src/cfe/ИнтеграцияСRabbitMQ/InformationRegisters/RMQ_НастройкиМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>RMQ_НастройкиМаршрутизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RMQ_ТочкиОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RMQ_Очереди</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/ИнтеграцияСRabbitMQ/Enums/RMQ_ТипыТочекОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>RMQ_ТипыТочекОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Direct</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Fanout</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Topic</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/ИнтеграцияСRabbitMQ/InformationRegisters/RMQ_НастройкиМаршрутизации/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВиртуальныйХост = Запись.ТочкаОбмена.ВиртуальныйХост;
	ТочкаОбменаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТочкаОбменаПриИзмененииНаСервере()
	Элементы.КлючМаршрутизации.Видимость = ЗначениеЗаполнено(Запись.ТочкаОбмена) И 
		RMQ_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.ТочкаОбмена, "ТипТочкиОбмена").ТипТочкиОбмена = Перечисления.RMQ_ТипыТочекОбмена.Topic;
КонецПроцедуры

&НаКлиенте
Процедура ТочкаОбменаПриИзменении(Элемент)
	ТочкаОбменаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если RMQ_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.ТочкаОбмена, "ТипТочкиОбмена").ТипТочкиОбмена = Перечисления.RMQ_ТипыТочекОбмена.Topic Тогда
		Если НЕ ЗначениеЗаполнено(Запись.КлючМаршрутизации) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Поле ""Ключ маршрутизации"" не заполнено'"), , "КлючМаршрутизации", "Запись", Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
